app/views/restaurants/index.html.erb

SELECT "restaurants".* FROM "restaurants"
SELECT COUNT(*) FROM "restaurants"
---
<% if Restaurant.all.any? %>

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 7]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 9]]
---
    <h3> Reviews for <%=  restaurant.name %></h3>
      <% if restaurant.reviews.any? %>

SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 2]]
---
              <%= link_to "Endorse #{restaurant.name}", review_endorsements_path(review), class: 'endorsements-link' %>
              <span class="endorsements_count"> <%= review.endorsements.count %> </span> <%= 'endorsement'.pluralize(review.endorsements.count) %>