app/controllers/endorsements_controller.rb

  def create
    @review = Review.find(params[:review_id])
    @review.endorsements.create
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "endorsements" ("review_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["review_id", 8], ["created_at", "2015-05-11 13:44:13.000159"], ["updated_at", "2015-05-11 13:44:13.000159"]]