app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 9]]
INSERT INTO "reviews" ("thoughts", "rating", "restaurant_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "cool place to eat\r\n"], ["rating", 1], ["restaurant_id", 1], ["user_id", 1], ["created_at", "2015-05-05 10:39:01.309626"], ["updated_at", "2015-05-05 10:39:01.309626"]]
---
  def create
    @restaurant = Restaurant.find review_params[:restaurant_id]
    @review = @restaurant.build_reivew current_user, review_params

    if @review.save